Uso da biblioteca pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
Q1_19 = pd.read_csv('Divvy_Trips_2019_Q1.csv')
Q1_20 = pd.read_csv('Divvy_Trips_2020_Q1.csv')

In [3]:
Q1_19.head()

,trip_id,start_time,end_time,bikeid,tripduration,from_station_id,from_station_name,to_station_id,to_station_name,usertype,gender,birthyear
0,21742443,2019-01-01 00:04:37,2019-01-01 00:11:07,2167,390.0,199,Wabash Ave & Grand Ave,84,Milwaukee Ave & Grand Ave,Subscriber,Male,1989.0
1,21742444,2019-01-01 00:08:13,2019-01-01 00:15:34,4386,441.0,44,State St & Randolph St,624,Dearborn St & Van Buren St (*),Subscriber,Female,1990.0
2,21742445,2019-01-01 00:13:23,2019-01-01 00:27:12,1524,829.0,15,Racine Ave & 18th St,644,Western Ave & Fillmore St (*),Subscriber,Female,1994.0
3,21742446,2019-01-01 00:13:45,2019-01-01 00:43:28,252,"1,783.0",123,California Ave & Milwaukee Ave,176,Clark St & Elm St,Subscriber,Male,1993.0
4,21742447,2019-01-01 00:14:52,2019-01-01 00:20:56,1170,364.0,173,Mies van der Rohe Way & Chicago Ave,35,Streeter Dr & Grand Ave,Subscriber,Male,1994.0

In [10]:
Q1_20.head()

,ride_id,rideable_type,started_at,ended_at,start_station_name,start_station_id,end_station_name,end_station_id,start_lat,start_lng,end_lat,end_lng,member_casual
0,EACB19130B0CDA4A,docked_bike,2020-01-21 20:06:59,2020-01-21 20:14:30,Western Ave & Leland Ave,239,Clark St & Leland Ave,326.0,41.9665,-87.6884,41.9671,-87.6674,member
1,8FED874C809DC021,docked_bike,2020-01-30 14:22:39,2020-01-30 14:26:22,Clark St & Montrose Ave,234,Southport Ave & Irving Park Rd,318.0,41.9616,-87.6660,41.9542,-87.6644,member
2,789F3C21E472CA96,docked_bike,2020-01-09 19:29:26,2020-01-09 19:32:17,Broadway & Belmont Ave,296,Wilton Ave & Belmont Ave,117.0,41.9401,-87.6455,41.9402,-87.6530,member
3,C9A388DAC6ABF313,docked_bike,2020-01-06 16:17:07,2020-01-06 16:25:56,Clark St & Randolph St,51,Fairbanks Ct & Grand Ave,24.0,41.8846,-87.6319,41.8918,-87.6206,member
4,943BC3CBECCFD662,docked_bike,2020-01-30 08:37:16,2020-01-30 08:42:48,Clinton St & Lake St,66,Wells St & Hubbard St,212.0,41.8856,-87.6418,41.8899,-87.6343,member

tabelas tem nomes e formatos de dados diferentes para várias colunas. primeiro passo é padronizá-las.
a coluna usertype/ member_casual fala sobre os 2 tipos de usuários com termos diferentes, também é necessário padronizar. 
vou usar a tabela mais recente (Q1_2020) como padrão, por ser a mais recente e pois o documento de apresentação do projeto usa os termos casual e member.
o dataframe Q1_20 tem colunas de latitude e longitude que o dataframe do ano anterior não tem. vou avaliar se precisamos dela, por enquanto, manter

In [5]:
Q1_19_columns = Q1_19.rename(columns = {'trip_id': 'ride_id', 'start_time': 'started_at', 'end_time':'ended_at', 'from_station_id': 'start_station_name', 'from_station_name': 'start_station_name', 'to_station_id':'end_station_id', 'to_station_name':'end_station_name', 'usertype': 'member_casual'} )

In [6]:
Q1_20.shape

(426887, 13)

In [7]:
Q1_19_columns.shape

(365069, 12)

merge deu errado, os tipos de dados são diferentes, eu não quero mergear, só adicionar colunas abaixo. porém parece que além dos nomes, os data types são diferentes

In [ ]:
#bike_data = Q1_20.merge(Q1_19_columns, on= 'started_at', how='outer')

In [8]:
Q1_19_columns.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365069 entries, 0 to 365068
Data columns (total 12 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   ride_id             365069 non-null  int64
 1   started_at          365069 non-null  object
 2   ended_at            365069 non-null  object
 3   bikeid              365069 non-null  int64
 4   tripduration        365069 non-null  object
 5   start_station_name  365069 non-null  int64
 6   start_station_name  365069 non-null  object
 7   end_station_id      365069 non-null  int64
 8   end_station_name    365069 non-null  object
 9   member_casual       365069 non-null  object
 10  gender              345358 non-null  object
 11  birthyear           347046 non-null  float64
dtypes: float64(1), int64(4), object(7)
memory usage: 33.4+ MB

In [9]:
Q1_19_columns['birthyear'] =Q1_19_columns['birthyear'].fillna(0)

In [10]:
Q1_19_columns['gender'] = Q1_19_columns['gender'].fillna('not informed')

In [11]:
Q1_20.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 426887 entries, 0 to 426886
Data columns (total 13 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   ride_id             426887 non-null  object
 1   rideable_type       426887 non-null  object
 2   started_at          426887 non-null  object
 3   ended_at            426887 non-null  object
 4   start_station_name  426887 non-null  object
 5   start_station_id    426887 non-null  int64
 6   end_station_name    426886 non-null  object
 7   end_station_id      426886 non-null  float64
 8   start_lat           426887 non-null  float64
 9   start_lng           426887 non-null  float64
 10  end_lat             426886 non-null  float64
 11  end_lng             426886 non-null  float64
 12  member_casual       426887 non-null  object
dtypes: float64(5), int64(1), object(7)
memory usage: 42.3+ MB

talvez mergear os dados não é necessário, posso ver evolução de um ano para outro, etc

In [32]:
Q1_19_columns['member_casual'].value_counts()

member_casual
Subscriber    341906
Customer       23163
Name: count, dtype: int64

In [12]:
def rename_member_casual(member_casual):
    if member_casual == 'Subscriber':
        return 'member'
    else:
        return 'casual'

In [13]:
Q1_19_columns['member_casual'] = Q1_19_columns['member_casual'].apply(rename_member_casual)

In [35]:
Q1_19_columns['member_casual'].value_counts()

member_casual
member    341906
casual     23163
Name: count, dtype: int64

In [14]:
Q1_20['member_casual'].value_counts()

member_casual
member    378407
casual     48480
Name: count, dtype: int64

In [36]:
pd.pivot_table(Q1_19_columns, values = ['ride_id'], index = 'member_casual', columns=['birthyear'],aggfunc='count')

              ride_id                                                          \
birthyear      1900.0 1901.0 1918.0 1921.0 1931.0 1933.0 1934.0 1938.0 1939.0
member_casual
casual            NaN    2.0    NaN    NaN    NaN    NaN    NaN    NaN    NaN
member           69.0    NaN   40.0   60.0    2.0    7.0    5.0    1.0   13.0

                      ...                                                   \
birthyear     1940.0  ...   1994.0  1995.0  1996.0  1997.0  1998.0  1999.0
member_casual         ...
casual           NaN  ...    475.0   524.0   356.0   231.0   231.0   210.0
member          29.0  ...  10975.0  8035.0  4979.0  1643.0  1441.0  1684.0


birthyear     2000.0 2001.0 2002.0 2003.0
member_casual
casual         225.0   29.0   27.0    NaN
member         601.0   89.0   56.0    2.0

[2 rows x 73 columns]

há vários birthyear que não fazem sentido para usuários de bicicletas em 2020.

In [37]:
Q1_19_columns['birthyear'].value_counts()

birthyear
1989.0    21014
1992.0    18924
1990.0    17410
1987.0    17155
1991.0    16146
          ...
1901.0        2
2003.0        2
1931.0        2
1941.0        1
1938.0        1
Name: count, Length: 73, dtype: int64

In [29]:
Q1_19_columns[(Q1_19_columns['birthyear']>=1945) & (Q1_19_columns['birthyear']<=1960)]

,ride_id,started_at,ended_at,bikeid,tripduration,start_station_name,start_station_name,end_station_id,end_station_name,member_casual,gender,birthyear
20,21742464,2019-01-01 00:29:21,2019-01-01 00:45:21,140,960.0,47,State St & Kinzie St,111,Sedgwick St & Huron St,member,Male,1957.0
22,21742466,2019-01-01 00:29:47,2019-01-01 00:49:15,5026,"1,168.0",85,Michigan Ave & Oak St,329,Lake Shore Dr & Diversey Pkwy,member,Male,1959.0
61,21742508,2019-01-01 01:26:27,2019-01-01 01:45:56,4105,"1,169.0",29,Noble St & Milwaukee Ave,137,Morgan Ave & 14th Pl,member,Female,1952.0
121,21742571,2019-01-01 02:51:20,2019-01-01 03:36:56,544,"2,736.0",318,Southport Ave & Irving Park Rd,119,Ashland Ave & Lake St (Temp),member,Male,1954.0
144,21742596,2019-01-01 04:05:03,2019-01-01 04:09:30,218,267.0,514,Ridge Blvd & Howard St,515,Paulina St & Howard St,member,Male,1951.0
...,...,...,...,...,...,...,...,...,...,...,...,...
364744,22178081,2019-03-31 19:03:41,2019-03-31 19:14:49,6088,668.0,447,Glenwood Ave & Morse Ave,447,Glenwood Ave & Morse Ave,member,Female,1956.0
364798,22178141,2019-03-31 19:26:59,2019-03-31 19:35:07,5103,488.0,110,Dearborn St & Erie St,301,Clark St & Schiller St,member,Male,1953.0
364923,22178302,2019-03-31 20:25:26,2019-03-31 20:29:09,892,223.0,174,Canal St & Madison St,98,LaSalle St & Washington St,member,Female,1957.0
364950,22178343,2019-03-31 20:58:22,2019-03-31 21:20:35,5710,"1,333.0",49,Dearborn St & Monroe St,324,Stockton Dr & Wrightwood Ave,member,Male,1954.0
365049,22178504,2019-03-31 23:10:19,2019-03-31 23:21:33,3767,674.0,50,Clark St & Ida B Wells Dr,50,Clark St & Ida B Wells Dr,member,Male,1957.0

filtrar usuários com birthyear menor ou igual a 1945, e aplicar a esses dados a média dos outros dados.

In [30]:
Q1_19_columns[Q1_19_columns['birthyear']>1945]['birthyear'].mean()

np.float64(1981.7417003768228)

In [31]:
Q1_19_columns[Q1_19_columns['birthyear']>1945]['birthyear'].median()

np.float64(1985.0)

In [17]:
Q1_19_columns[Q1_19_columns['birthyear']>1945]['birthyear'].mode()

0    1989.0
Name: birthyear, dtype: float64

In [16]:
Q1_19_columns['birthyear'].mean()

np.float64(1981.6742967791013)

In [33]:
def replace_birthyear(birthyear):
    if birthyear <= 1945:
        return 1989
    else:
        return birthyear

In [38]:
Q1_19_columns['birthyear'].value_counts(dropna=False)

birthyear
1989.0    39501
1992.0    18924
1990.0    17410
1987.0    17155
1991.0    16146
1988.0    14588
1993.0    14197
1985.0    13411
1986.0    13210
1984.0    12835
1994.0    11450
1982.0    10641
1983.0    10559
1981.0     9733
1980.0     9247
1995.0     8559
1977.0     8116
1979.0     7432
1978.0     6523
1969.0     5923
1976.0     5897
1974.0     5842
1970.0     5789
1996.0     5335
1972.0     5031
1966.0     4663
1975.0     4591
1964.0     4569
1962.0     4508
1968.0     4408
1971.0     4023
1973.0     3973
1965.0     3778
1961.0     3534
1967.0     3499
1963.0     3449
1960.0     3336
1959.0     2377
1958.0     2376
1957.0     2136
1956.0     2052
1955.0     1904
1999.0     1894
1997.0     1874
1998.0     1672
1954.0     1384
1951.0     1132
1952.0     1096
1953.0      930
2000.0      826
1950.0      464
1948.0      332
1946.0      307
1949.0      232
2001.0      118
1947.0       93
2002.0       83
2003.0        2
Name: count, dtype: int64

In [35]:
Q1_19_columns['birthyear'] = Q1_19_columns['birthyear'].apply(replace_birthyear)

In [36]:
Q1_19_columns.groupby('gender')['ride_id'].nunique()

gender
Female           66918
Male            278440
not informed     19711
Name: ride_id, dtype: int64

In [39]:
pd.pivot_table(Q1_19_columns, values = ['ride_id'], index = 'member_casual', columns=['birthyear'],aggfunc='count')

              ride_id                                                     \
birthyear      1946.0 1947.0 1948.0 1949.0 1950.0  1951.0  1952.0 1953.0
member_casual
casual            NaN    NaN    NaN    1.0    NaN     5.0     3.0    NaN
member          307.0   93.0  332.0  231.0  464.0  1127.0  1093.0  930.0

                               ...                                           \
birthyear      1954.0  1955.0  ...   1994.0  1995.0  1996.0  1997.0  1998.0
member_casual                  ...
casual            4.0     4.0  ...    475.0   524.0   356.0   231.0   231.0
member         1380.0  1900.0  ...  10975.0  8035.0  4979.0  1643.0  1441.0


birthyear      1999.0 2000.0 2001.0 2002.0 2003.0
member_casual
casual          210.0  225.0   29.0   27.0    NaN
member         1684.0  601.0   89.0   56.0    2.0

[2 rows x 58 columns]

In [37]:
Q1_19.columns

Index(['trip_id', 'start_time', 'end_time', 'bikeid', 'tripduration',
       'from_station_id', 'from_station_name', 'to_station_id',
       'to_station_name', 'usertype', 'gender', 'birthyear'],
      dtype='object')